MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS806/mcu.h
/* C2INTE */
/* Bitname _TBIE cannot be defined because it is used by more than one SFR */
/* Bitname _RBIE cannot be defined because it is used by more than one SFR */
/* Bitname _RBOVIE cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOIE cannot be defined because it is used by more than one SFR */
/* Bitname _ERRIE cannot be defined because it is used by more than one SFR */
/* Bitname _WAKIE cannot be defined because it is used by more than one SFR */
/* Bitname _IVRIE cannot be defined because it is used by more than one SFR */

/* C2EC */
/* Bitname _RERRCNT cannot be defined because it is used by more than one SFR */
/* Bitname _TERRCNT cannot be defined because it is used by more than one SFR */

/* C2CFG1 */
/* Bitname _BRP cannot be defined because it is used by more than one SFR */
/* Bitname _SJW cannot be defined because it is used by more than one SFR */
/* Bitname _BRP0 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP2 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP3 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP4 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP5 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW0 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW1 cannot be defined because it is used by more than one SFR */

/* C2CFG2 */
/* Bitname _PRSEG cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH cannot be defined because it is used by more than one SFR */
/* Bitname _SAM cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PHTS cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH cannot be defined because it is used by more than one SFR */
/* Bitname _WAKFIL cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG0 cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG1 cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH2 cannot be defined because it is used by more than one SFR */

/* C2FEN1 */
/* Bitname _FLTEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN13 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN14 cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEN15 cannot be defined because it is used by more than one SFR */

/* C2FMSKSEL1 */
/* Bitname _F0MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F1MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F2MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F3MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F4MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F5MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F6MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F7MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F0MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F0MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F1MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F1MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F2MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F2MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F3MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F3MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F4MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F4MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F5MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F5MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F6MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F6MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F7MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F7MSK1 cannot be defined because it is used by more than one SFR */

/* C2FMSKSEL2 */
/* Bitname _F8MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F9MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F10MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F11MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F12MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F13MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F14MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F15MSK cannot be defined because it is used by more than one SFR */
/* Bitname _F8MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F8MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F9MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F9MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F10MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F10MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F11MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F11MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F12MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F12MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F13MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F13MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F14MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F14MSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _F15MSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _F15MSK1 cannot be defined because it is used by more than one SFR */

