MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS806/mcu.h
#define _SPI2IMSKH_RXMSK1_POSITION               0x00000009
#define _SPI2IMSKH_RXMSK1_MASK                   0x00000200
#define _SPI2IMSKH_RXMSK1_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK2_POSITION               0x0000000A
#define _SPI2IMSKH_RXMSK2_MASK                   0x00000400
#define _SPI2IMSKH_RXMSK2_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK3_POSITION               0x0000000B
#define _SPI2IMSKH_RXMSK3_MASK                   0x00000800
#define _SPI2IMSKH_RXMSK3_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK4_POSITION               0x0000000C
#define _SPI2IMSKH_RXMSK4_MASK                   0x00001000
#define _SPI2IMSKH_RXMSK4_LENGTH                 0x00000001

#define _SPI2IMSKH_RXMSK5_POSITION               0x0000000D
#define _SPI2IMSKH_RXMSK5_MASK                   0x00002000
#define _SPI2IMSKH_RXMSK5_LENGTH                 0x00000001

#define _SPI2URDTL_SPI2URDTL_POSITION            0x00000000
#define _SPI2URDTL_SPI2URDTL_MASK                0x0000FFFF
#define _SPI2URDTL_SPI2URDTL_LENGTH              0x00000010

#define _SPI2URDTL_URDATA_POSITION               0x00000000
#define _SPI2URDTL_URDATA_MASK                   0x0000FFFF
#define _SPI2URDTL_URDATA_LENGTH                 0x00000010

#define _SPI2URDTH_SPI2URDTH_POSITION            0x00000000
#define _SPI2URDTH_SPI2URDTH_MASK                0x0000FFFF
#define _SPI2URDTH_SPI2URDTH_LENGTH              0x00000010

#define _SPI2URDTH_URDATA_POSITION               0x00000000
#define _SPI2URDTH_URDATA_MASK                   0x0000FFFF
#define _SPI2URDTH_URDATA_LENGTH                 0x00000010

#define _ADCON1L_NRE_POSITION                    0x00000007
#define _ADCON1L_NRE_MASK                        0x00000080
#define _ADCON1L_NRE_LENGTH                      0x00000001

#define _ADCON1L_ADSIDL_POSITION                 0x0000000D
#define _ADCON1L_ADSIDL_MASK                     0x00002000
#define _ADCON1L_ADSIDL_LENGTH                   0x00000001

#define _ADCON1L_ADON_POSITION                   0x0000000F
#define _ADCON1L_ADON_MASK                       0x00008000
#define _ADCON1L_ADON_LENGTH                     0x00000001

#define _ADCON1H_SHRRES_POSITION                 0x00000005
#define _ADCON1H_SHRRES_MASK                     0x00000060
#define _ADCON1H_SHRRES_LENGTH                   0x00000002

#define _ADCON1H_FORM_POSITION                   0x00000007
#define _ADCON1H_FORM_MASK                       0x00000080
#define _ADCON1H_FORM_LENGTH                     0x00000001

#define _ADCON1H_SHRRES0_POSITION                0x00000005
#define _ADCON1H_SHRRES0_MASK                    0x00000020
#define _ADCON1H_SHRRES0_LENGTH                  0x00000001

#define _ADCON1H_SHRRES1_POSITION                0x00000006
#define _ADCON1H_SHRRES1_MASK                    0x00000040
#define _ADCON1H_SHRRES1_LENGTH                  0x00000001

#define _ADCON2L_SHRADCS_POSITION                0x00000000
#define _ADCON2L_SHRADCS_MASK                    0x0000007F
#define _ADCON2L_SHRADCS_LENGTH                  0x00000007

#define _ADCON2L_SHREISEL_POSITION               0x00000008
#define _ADCON2L_SHREISEL_MASK                   0x00000700
#define _ADCON2L_SHREISEL_LENGTH                 0x00000003

#define _ADCON2L_EIEN_POSITION                   0x0000000C
#define _ADCON2L_EIEN_MASK                       0x00001000
#define _ADCON2L_EIEN_LENGTH                     0x00000001

#define _ADCON2L_REFERCIE_POSITION               0x0000000E
#define _ADCON2L_REFERCIE_MASK                   0x00004000
#define _ADCON2L_REFERCIE_LENGTH                 0x00000001

#define _ADCON2L_REFCIE_POSITION                 0x0000000F
#define _ADCON2L_REFCIE_MASK                     0x00008000
#define _ADCON2L_REFCIE_LENGTH                   0x00000001

#define _ADCON2L_SHRADCS0_POSITION               0x00000000
#define _ADCON2L_SHRADCS0_MASK                   0x00000001
#define _ADCON2L_SHRADCS0_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS1_POSITION               0x00000001
#define _ADCON2L_SHRADCS1_MASK                   0x00000002
#define _ADCON2L_SHRADCS1_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS2_POSITION               0x00000002
#define _ADCON2L_SHRADCS2_MASK                   0x00000004
#define _ADCON2L_SHRADCS2_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS3_POSITION               0x00000003
#define _ADCON2L_SHRADCS3_MASK                   0x00000008
#define _ADCON2L_SHRADCS3_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS4_POSITION               0x00000004
#define _ADCON2L_SHRADCS4_MASK                   0x00000010
#define _ADCON2L_SHRADCS4_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS5_POSITION               0x00000005
#define _ADCON2L_SHRADCS5_MASK                   0x00000020
#define _ADCON2L_SHRADCS5_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS6_POSITION               0x00000006
#define _ADCON2L_SHRADCS6_MASK                   0x00000040
#define _ADCON2L_SHRADCS6_LENGTH                 0x00000001

#define _ADCON2L_SHREISEL0_POSITION              0x00000008
#define _ADCON2L_SHREISEL0_MASK                  0x00000100
#define _ADCON2L_SHREISEL0_LENGTH                0x00000001

#define _ADCON2L_SHREISEL1_POSITION              0x00000009
#define _ADCON2L_SHREISEL1_MASK                  0x00000200
#define _ADCON2L_SHREISEL1_LENGTH                0x00000001

#define _ADCON2L_SHREISEL2_POSITION              0x0000000A
#define _ADCON2L_SHREISEL2_MASK                  0x00000400
#define _ADCON2L_SHREISEL2_LENGTH                0x00000001

#define _ADCON2H_SHRSAMC_POSITION                0x00000000
#define _ADCON2H_SHRSAMC_MASK                    0x000003FF
#define _ADCON2H_SHRSAMC_LENGTH                  0x0000000A

#define _ADCON2H_REFERR_POSITION                 0x0000000E
#define _ADCON2H_REFERR_MASK                     0x00004000
#define _ADCON2H_REFERR_LENGTH                   0x00000001

#define _ADCON2H_REFRDY_POSITION                 0x0000000F
#define _ADCON2H_REFRDY_MASK                     0x00008000
#define _ADCON2H_REFRDY_LENGTH                   0x00000001

#define _ADCON2H_SHRSAMC0_POSITION               0x00000000
#define _ADCON2H_SHRSAMC0_MASK                   0x00000001
#define _ADCON2H_SHRSAMC0_LENGTH                 0x00000001

