MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS806/mcu.h
#define _IEC7_ADCAN7IE_POSITION                  0x00000005
#define _IEC7_ADCAN7IE_MASK                      0x00000020
#define _IEC7_ADCAN7IE_LENGTH                    0x00000001

#define _IEC7_SPI1EIE_POSITION                   0x0000000C
#define _IEC7_SPI1EIE_MASK                       0x00001000
#define _IEC7_SPI1EIE_LENGTH                     0x00000001

#define _IEC7_SPI2EIE_POSITION                   0x0000000D
#define _IEC7_SPI2EIE_MASK                       0x00002000
#define _IEC7_SPI2EIE_LENGTH                     0x00000001

#define _IEC7_SPI3EIE_POSITION                   0x0000000E
#define _IEC7_SPI3EIE_MASK                       0x00004000
#define _IEC7_SPI3EIE_LENGTH                     0x00000001

#define _IEC8_CLC1IE_POSITION                    0x0000000A
#define _IEC8_CLC1IE_MASK                        0x00000400
#define _IEC8_CLC1IE_LENGTH                      0x00000001

#define _IEC8_CLC2IE_POSITION                    0x0000000B
#define _IEC8_CLC2IE_MASK                        0x00000800
#define _IEC8_CLC2IE_LENGTH                      0x00000001

#define _IEC8_CLC3IE_POSITION                    0x0000000C
#define _IEC8_CLC3IE_MASK                        0x00001000
#define _IEC8_CLC3IE_LENGTH                      0x00000001

#define _IEC8_CLC4IE_POSITION                    0x0000000D
#define _IEC8_CLC4IE_MASK                        0x00002000
#define _IEC8_CLC4IE_LENGTH                      0x00000001

#define _IEC8_ICDIF_POSITION                     0x0000000E
#define _IEC8_ICDIF_MASK                         0x00004000
#define _IEC8_ICDIF_LENGTH                       0x00000001

#define _IEC8_JTAGIE_POSITION                    0x0000000F
#define _IEC8_JTAGIE_MASK                        0x00008000
#define _IEC8_JTAGIE_LENGTH                      0x00000001

#define _IEC9_PTGSTEPIE_POSITION                 0x00000001
#define _IEC9_PTGSTEPIE_MASK                     0x00000002
#define _IEC9_PTGSTEPIE_LENGTH                   0x00000001

#define _IEC9_PTGWDTIE_POSITION                  0x00000002
#define _IEC9_PTGWDTIE_MASK                      0x00000004
#define _IEC9_PTGWDTIE_LENGTH                    0x00000001

#define _IEC9_PTG0IE_POSITION                    0x00000003
#define _IEC9_PTG0IE_MASK                        0x00000008
#define _IEC9_PTG0IE_LENGTH                      0x00000001

#define _IEC9_PTG1IE_POSITION                    0x00000004
#define _IEC9_PTG1IE_MASK                        0x00000010
#define _IEC9_PTG1IE_LENGTH                      0x00000001

#define _IEC9_PTG2IE_POSITION                    0x00000005
#define _IEC9_PTG2IE_MASK                        0x00000020
#define _IEC9_PTG2IE_LENGTH                      0x00000001

#define _IEC9_PTG3IE_POSITION                    0x00000006
#define _IEC9_PTG3IE_MASK                        0x00000040
#define _IEC9_PTG3IE_LENGTH                      0x00000001

#define _IEC9_ADCAN8IE_POSITION                  0x00000007
#define _IEC9_ADCAN8IE_MASK                      0x00000080
#define _IEC9_ADCAN8IE_LENGTH                    0x00000001

#define _IEC9_ADCAN9IE_POSITION                  0x00000008
#define _IEC9_ADCAN9IE_MASK                      0x00000100
#define _IEC9_ADCAN9IE_LENGTH                    0x00000001

#define _IEC9_ADCAN10IE_POSITION                 0x00000009
#define _IEC9_ADCAN10IE_MASK                     0x00000200
#define _IEC9_ADCAN10IE_LENGTH                   0x00000001

#define _IEC9_ADCAN11IE_POSITION                 0x0000000A
#define _IEC9_ADCAN11IE_MASK                     0x00000400
#define _IEC9_ADCAN11IE_LENGTH                   0x00000001

#define _IEC9_ADCAN12IE_POSITION                 0x0000000B
#define _IEC9_ADCAN12IE_MASK                     0x00000800
#define _IEC9_ADCAN12IE_LENGTH                   0x00000001

#define _IEC9_ADCAN13IE_POSITION                 0x0000000C
#define _IEC9_ADCAN13IE_MASK                     0x00001000
#define _IEC9_ADCAN13IE_LENGTH                   0x00000001

#define _IEC9_ADCAN14IE_POSITION                 0x0000000D
#define _IEC9_ADCAN14IE_MASK                     0x00002000
#define _IEC9_ADCAN14IE_LENGTH                   0x00000001

#define _IEC9_ADCAN15IE_POSITION                 0x0000000E
#define _IEC9_ADCAN15IE_MASK                     0x00004000
#define _IEC9_ADCAN15IE_LENGTH                   0x00000001

#define _IEC9_ADCAN16IE_POSITION                 0x0000000F
#define _IEC9_ADCAN16IE_MASK                     0x00008000
#define _IEC9_ADCAN16IE_LENGTH                   0x00000001

#define _IEC10_ADCAN17IE_POSITION                0x00000000
#define _IEC10_ADCAN17IE_MASK                    0x00000001
#define _IEC10_ADCAN17IE_LENGTH                  0x00000001

#define _IEC10_ADCAN18IE_POSITION                0x00000001
#define _IEC10_ADCAN18IE_MASK                    0x00000002
#define _IEC10_ADCAN18IE_LENGTH                  0x00000001

#define _IEC10_ADCAN19IE_POSITION                0x00000002
#define _IEC10_ADCAN19IE_MASK                    0x00000004
#define _IEC10_ADCAN19IE_LENGTH                  0x00000001

#define _IEC10_ADCAN20IE_POSITION                0x00000003
#define _IEC10_ADCAN20IE_MASK                    0x00000008
#define _IEC10_ADCAN20IE_LENGTH                  0x00000001

#define _IEC10_ADCAN21IE_POSITION                0x00000004
#define _IEC10_ADCAN21IE_MASK                    0x00000010
#define _IEC10_ADCAN21IE_LENGTH                  0x00000001

#define _IEC10_I2C1BCIE_POSITION                 0x0000000D
#define _IEC10_I2C1BCIE_MASK                     0x00002000
#define _IEC10_I2C1BCIE_LENGTH                   0x00000001

#define _IEC10_I2C2BCIE_POSITION                 0x0000000E
#define _IEC10_I2C2BCIE_MASK                     0x00004000
#define _IEC10_I2C2BCIE_LENGTH                   0x00000001

#define _IEC11_ADCMP0IE_POSITION                 0x00000001
#define _IEC11_ADCMP0IE_MASK                     0x00000002
#define _IEC11_ADCMP0IE_LENGTH                   0x00000001

#define _IEC11_ADCMP1IE_POSITION                 0x00000002
#define _IEC11_ADCMP1IE_MASK                     0x00000004
#define _IEC11_ADCMP1IE_LENGTH                   0x00000001

